; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 obj7 obj13 obj15 obj16 - airport
	obj1 obj8 - city
	obj2 obj5 obj10 obj14 - package
	obj4 obj6 obj11 obj12 - truck
	obj9 - airplane
)

(:init
	(in-city obj15 obj8)
	(at obj9 obj3)
	(at obj10 obj7)
	(at obj4 obj3)
	(at obj2 obj0)
	(in-city obj3 obj1)
	(in-city obj13 obj1)
	(at obj14 obj0)
	(at obj12 obj7)
	(at obj5 obj0)
	(at obj6 obj0)
	(in-city obj16 obj8)
	(at obj11 obj0)
	(in-city obj0 obj1)
	(in-city obj7 obj8)
)

(:goal (and
	(at obj14 obj7)
	(at obj5 obj16)
	(at obj10 obj13)
	(at obj2 obj15)
))
)

; plan
1. (fly obj9 obj3 obj0)
   deleted: (at obj9 obj3)
   added: (at obj9 obj0)
   goals met: 0 of 4
2. (load obj9 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj9)
   goals met: 0 of 4
3. (load obj9 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj9)
   goals met: 0 of 4
4. (load obj9 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj9)
   goals met: 0 of 4
5. (fly obj9 obj0 obj13)
   deleted: (at obj9 obj0)
   added: (at obj9 obj13)
   goals met: 0 of 4
6. (fly obj9 obj13 obj15)
   deleted: (at obj9 obj13)
   added: (at obj9 obj15)
   goals met: 0 of 4
7. (unload obj9 obj2 obj15)
   deleted: (in obj2 obj9)
   added: (at obj2 obj15)
   goals met: 1 of 4
8. (fly obj9 obj15 obj13)
   deleted: (at obj9 obj15)
   added: (at obj9 obj13)
   goals met: 1 of 4
9. (fly obj9 obj13 obj16)
   deleted: (at obj9 obj13)
   added: (at obj9 obj16)
   goals met: 1 of 4
10. (unload obj9 obj5 obj16)
   deleted: (in obj5 obj9)
   added: (at obj5 obj16)
   goals met: 2 of 4
11. (fly obj9 obj16 obj13)
   deleted: (at obj9 obj16)
   added: (at obj9 obj13)
   goals met: 2 of 4
12. (fly obj9 obj13 obj7)
   deleted: (at obj9 obj13)
   added: (at obj9 obj7)
   goals met: 2 of 4
13. (unload obj9 obj14 obj7)
   deleted: (in obj14 obj9)
   added: (at obj14 obj7)
   goals met: 3 of 4
14. (load obj9 obj10 obj7)
   deleted: (at obj10 obj7)
   added: (in obj10 obj9)
   goals met: 3 of 4
15. (fly obj9 obj7 obj13)
   deleted: (at obj9 obj7)
   added: (at obj9 obj13)
   goals met: 3 of 4
16. (unload obj9 obj10 obj13)
   deleted: (in obj10 obj9)
   added: (at obj10 obj13)
   goals met: 4 of 4
